flow/src/test/resources/json/FullTypedTestData.xml

<?xml version="1.0" encoding="utf-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.workflow.jd.com/">
    <soapenv:Body>
        <ser:test>
            <arg0>string</arg0>
            <arg1>
                <bigDecimalVar>12.12</bigDecimalVar>
                <bigIntegerVar>13</bigIntegerVar>
                <booleanVar>true</booleanVar>
                <byteVar>13</byteVar>
                <charVar>13</charVar>
                <child>
                    <booleanVar>true</booleanVar>
                    <charVar>13</charVar>
                    <doubleVar>123.113</doubleVar>
                    <floatVar>123.112</floatVar>
                    <intVar>13</intVar>
                    <longVar>1321</longVar>
                    <shortVar>13</shortVar>
                    <strVar>string</strVar>
                    <subChild>
                        <intVar>13</intVar>
                    </subChild>
                </child>
                <childHashMap>
                    <entry>
                        <key>string</key>
                        <value>
                            <booleanVar>true</booleanVar>
                            <charVar>13</charVar>
                            <doubleVar>123.113</doubleVar>
                            <floatVar>123.112</floatVar>
                            <intVar>13</intVar>
                            <longVar>1321</longVar>
                            <shortVar>13</shortVar>
                            <strVar>string</strVar>
                            <subChild>
                                <intVar>13</intVar>
                            </subChild>
                        </value>
                    </entry>
                </childHashMap>
                <childList>
                    <booleanVar>true</booleanVar>
                    <charVar>13</charVar>
                    <doubleVar>123.113</doubleVar>
                    <floatVar>123.112</floatVar>
                    <intVar>13</intVar>
                    <longVar>1321</longVar>
                    <shortVar>13</shortVar>
                    <strVar>string</strVar>
                    <subChild>
                        <intVar>13</intVar>
                    </subChild>
                </childList>
                <children>
                    <booleanVar>true</booleanVar>
                    <charVar>13</charVar>
                    <doubleVar>123.113</doubleVar>
                    <floatVar>123.112</floatVar>
                    <intVar>13</intVar>
                    <longVar>1321</longVar>
                    <shortVar>13</shortVar>
                    <strVar>string</strVar>
                    <subChild>
                        <intVar>13</intVar>
                    </subChild>
                </children>
                <childrenChildren>
                    <item>
                        <booleanVar>true</booleanVar>
                        <charVar>13</charVar>
                        <doubleVar>123.113</doubleVar>
                        <floatVar>123.112</floatVar>
                        <intVar>13</intVar>
                        <longVar>1321</longVar>
                        <shortVar>13</shortVar>
                        <strVar>string</strVar>
                        <subChild>
                            <intVar>13</intVar>
                        </subChild>
                    </item>
                </childrenChildren>
                <doubleVar>123.113</doubleVar>
                <floatVar>123.112</floatVar>
                <intVar>13</intVar>
                <longVar>1321</longVar>
                <shortVar>13</shortVar>
                <strArrArr>
                    <item>string</item>
                </strArrArr>
                <strArrArrArr>
                    <item>
                        <item>string</item>
                    </item>
                </strArrArrArr>
                <strArrArrArrArr>
                    <item>
                        <item>
                            <item>string</item>
                        </item>
                        <item>
                            <item>string</item>
                        </item>
                    </item>
                </strArrArrArrArr>
                <strArray>string</strArray>
                <strVar>string</strVar>
                <stringHashMap>
                    <entry>
                        <key>string</key>
                        <value>string</value>
                    </entry>
                </stringHashMap>
                <stringList>string</stringList>
            </arg1>
        </ser:test>
    </soapenv:Body>
    <soapenv:Header/>
</soapenv:Envelope>